let ADWSSrv =
DeviceNetworkEvents
| where TimeGenerated > ago(1h)
| where ActionType == "InboundConnectionAccepted"
| where LocalPort == 9389
| distinct DeviceName;
SecurityEvent
| where TimeGenerated > ago(1h)
| where EventID == 1644 or EventID == 4662
| where Computer has_any(ADWSSrv)