DeviceProcessEvents
| where Timestamp > ago(1h)
| where InitiatingProcessCommandLine has "nslookup" and InitiatingProcessCommandLine has "findstr"
| extend IP = extract("([0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3})", 1, InitiatingProcessCommandLine)
| where isnotempty(IP) and not(ipv4_is_private(IP))