let DSDomains=externaldata(Type:string,Value:string)
[h'https://raw.githubusercontent.com/SlimKQL/Hunting-Queries-Detection-Rules/refs/heads/main/IOC/DarkSpectreIOCs.csv']
| where Type=="domain"
| project Value;
let DSExtensions=externaldata(Type:string,Value:string)
[h'https://raw.githubusercontent.com/SlimKQL/Hunting-Queries-Detection-Rules/refs/heads/main/IOC/DarkSpectreIOCs.csv']
| where Type=="extensionid"
| project Value;
let DomainScan =
DeviceNetworkEvents
| where Timestamp > ago(30d)
| where ActionType == "ConnectionSuccess"
| where RemoteUrl has_any(DSDomains);
DeviceFileEvents
| where Timestamp > ago(30d)
| where ActionType == "FileCreated"
| where FileName has_any(DSExtensions)
| union DomainScan