let Lookback = 1h;
EmailUrlInfo
| where Timestamp > ago(Lookback)
| where Url startswith "https://login.microsoftonline.com/common/oauth2/v2.0/authorize" and Url has "prompt=none"
| join EmailEvents on NetworkMessageId
| where EmailDirection == "Inbound"
| where DeliveryAction <> "Blocked"