let ScanPeriod = 3d;
let AxiosIOCSHA1 = dynamic([
"2553649f2322049666871cea80a5d0d6adc700ca",
"d6f3f62fd3b9f5432f5782b62d8cfd5247d5ee71",
"07d889e2dadce6f3910dcbc253317d28ca61c766"]);
let AxiosIOCSHA256 = dynamic([
"92ff08773995ebc8d55ec4b8e1a225d0d1e51efa4ef88b8849d0071230c9645a",
"617b67a8e1210e4fc87c92d1d1da45a2f311c08d26e89b12307cf583c900d101",
"fcb81618bb15edfdedfb638b4c08a2af9cac9ecfa551af135a8402bf980375cf"]);
let FileHashScan =
DeviceFileEvents
| where Timestamp > ago(ScanPeriod)
| where SHA1 has_any(AxiosIOCSHA1) or SHA256 has_any(AxiosIOCSHA256);
DeviceNetworkEvents
| where Timestamp > ago(ScanPeriod)
| where RemoteIP == "142.11.206.73" or RemoteUrl has "sfrclak.com"
| union FileHashScan