let MaliciousExtensions = dynamic([
"nnpnnpemnckcfdebeekibpiijlicmpom",
"kkodiihpgodmdankclfibbiphjkfdenh",
"oaikpkmjciadfpddlpjjdapglcihgdle",
"dpggmcodlahmljkhlmpgpdcffdaoccni",
"acmfnomgphggonodopogfbmkneepfgnh",
"mnhffkhmpnefgklngfmlndmkimimbphc",
"cedgndijpacnfbdggppddacngjfdkaca",
"bbdnohkpnbkdkmnkddobeafboooinpla",
"egmennebgadmncfjafcemlecimkepcle",
"bibjgkidgpfbblifamdlkdlhgihmfohh",
"cplhlgabfijoiabgkigdafklbhhdkahj",
"befflofjcniongenjmbkgkoljhgliihe",
"pkgciiiancapdlpcbppfkmeaieppikkk",
"llimhhconnjiflfimocjggfjdlmlhblm",
"oeiomhmbaapihbilkfkhmlajkeegnjhe",
"oeiomhmbaapihbilkfkhmlajkeegnjhe",
"ndlbedplllcgconngcnfmkadhokfaaln",
"jiofmdifioeejeilfkpegipdjiopiekl",
"hihblcmlaaademjlakdpicchbjnnnkbo"
]);
DeviceFileEvents
| where Timestamp > ago(30d)
| where ActionType == "FileCreated"
| where FileName has_any(MaliciousExtensions)
| summarize arg_max(TimeGenerated, *) by DeviceName